/*========================================================================
Copyright (c) 2010 by LG Cappuccino Inc.  All Rights Reserved.

			EDIT HISTORY FOR MODULE

This section contains comments describing changes made to the module.
Notice that changes are listed in reverse chronological order.

when		who			what, where, why
----------	----------	---------------------------------------------------
2010/09/13	kihoon.kim	cappuccino Initial release.
=========================================================================*/
package com.lge.util;

import com.lge.config.AppConfig;

//------------------------------------------------------------------------
/// ClndLib
//------------------------------------------------------------------------
public class ClndLib {

    //-------------------------------------------------------------------------
    // Member Variables
    public static final int	 		E_SUNDAY 			= 0;
    public static final int	 		E_MONDAY			= 1;
    public static final int	 		E_TUESDAY			= 2;
    public static final int	 		E_WEDNESDAY			= 3;
    public static final int	 		E_THURSDAY			= 4;
    public static final int	 		E_FRIDAY			= 5;
    public static final int	 		E_SATURDAY			= 6;

    private static final int		CLNDLIB_NOTINVALID	= -1;

    private static final int		s_arrnMonthDay[] = {0,31,28,31,30,31,30,31,31,30,31,30,31};
    private static final byte		s_arrbtKK[][] = {
        /*1881*/   {1, 2, 1, 2, 1, 2, 2, 3, 2, 2, 1, 2, 1},
        {1, 2, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 0},
        {1, 1, 2, 1, 1, 2, 1, 2, 2, 2, 1, 2, 0},
        {2, 1, 1, 2, 1, 3, 2, 1, 2, 2, 1, 2, 2},
        {2, 1, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 0},
        {2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 0},
        {2, 2, 1, 2, 3, 2, 1, 1, 2, 1, 2, 1, 2},
        {2, 1, 2, 2, 1, 2, 1, 1, 2, 1, 2, 1, 0},
        {2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0},
        {1, 2, 3, 2, 1, 2, 2, 1, 2, 1, 2, 1, 2},

        /*1891*/   {1, 2, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 0},
        {1, 1, 2, 1, 1, 2, 3, 2, 2, 1, 2, 2, 2},
        {1, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 0},
        {1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 0},
        {2, 1, 2, 1, 2, 3, 1, 2, 1, 2, 1, 2, 1},
        {2, 2, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 0},
        {1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 0},
        {2, 1, 2, 3, 2, 2, 1, 2, 1, 2, 1, 2, 1},
        {2, 1, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 0},
        {1, 2, 1, 1, 2, 1, 2, 2, 3, 2, 2, 1, 2},

        /*1901*/   {1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 1, 0},
        {2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 0},
        {1, 2, 1, 2, 1, 3, 2, 1, 1, 2, 2, 1, 2},
        {2, 2, 1, 2, 1, 1, 2, 1, 1, 2, 2, 1, 0},
        {2, 2, 1, 2, 2, 1, 1, 2, 1, 2, 1, 2, 0},
        {1, 2, 2, 1, 4, 1, 2, 1, 2, 1, 2, 1, 2},
        {1, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 1, 0},
        {2, 1, 1, 2, 2, 1, 2, 1, 2, 2, 1, 2, 0},
        {1, 2, 3, 1, 2, 1, 2, 1, 2, 2, 2, 1, 2},
        {1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 1, 0},

        /*1911*/   {2, 1, 2, 1, 1, 2, 3, 1, 2, 2, 1, 2, 2},
        {2, 1, 2, 1, 1, 2, 1, 1, 2, 2, 1, 2, 0},
        {2, 2, 1, 2, 1, 1, 2, 1, 1, 2, 1, 2, 0},
        {2, 2, 1, 2, 2, 3, 1, 2, 1, 2, 1, 1, 2},
        {2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0},
        {1, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 1, 0},
        {2, 1, 3, 2, 1, 2, 2, 1, 2, 2, 1, 2, 1},
        {2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 1, 2, 0},
        {1, 2, 1, 1, 2, 1, 2, 3, 2, 2, 1, 2, 2},
        {1, 2, 1, 1, 2, 1, 1, 2, 2, 1, 2, 2, 0},

        /*1921*/   {2, 1, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 0},
        {2, 1, 2, 2, 1, 3, 2, 1, 1, 2, 1, 2, 2},
        {1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 1, 2, 0},
        {2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 1, 1, 0},
        {2, 1, 2, 2, 3, 2, 1, 2, 2, 1, 2, 1, 2},
        {1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1, 0},
        {2, 1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 0},
        {1, 2, 3, 1, 2, 1, 1, 2, 2, 1, 2, 2, 2},
        {1, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 2, 0},
        {1, 2, 2, 1, 1, 2, 3, 1, 2, 1, 2, 2, 1},

        /*1931*/   {2, 2, 2, 1, 1, 2, 1, 1, 2, 1, 2, 1, 0},
        {2, 2, 2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 0},
        {1, 2, 2, 1, 2, 4, 1, 2, 1, 2, 1, 1, 2},
        {1, 2, 1, 2, 2, 1, 2, 2, 1, 2, 1, 2, 0},
        {1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1, 0},
        {2, 1, 1, 4, 1, 2, 1, 2, 1, 2, 2, 2, 1},
        {2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 2, 1, 0},
        {2, 2, 1, 1, 2, 1, 1, 4, 1, 2, 2, 1, 2},
        {2, 2, 1, 1, 2, 1, 1, 2, 1, 2, 1, 2, 0},
        {2, 2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 0},

        /*1941*/   {2, 2, 1, 2, 2, 1, 4, 1, 1, 2, 1, 2, 1},
        {2, 1, 2, 2, 1, 2, 2, 1, 2, 1, 1, 2, 0},
        {1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1, 2, 0},
        {1, 1, 2, 1, 4, 1, 2, 1, 2, 2, 1, 2, 2},
        {1, 1, 2, 1, 1, 2, 1, 2, 2, 2, 1, 2, 0},
        {2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 1, 2, 0},
        {2, 2, 3, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2},
        {2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 0},
        {2, 2, 1, 2, 1, 2, 1, 3, 2, 1, 2, 1, 2},
        {2, 1, 2, 2, 1, 2, 1, 1, 2, 1, 2, 1, 0},

        /*1951*/   {2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0},
        {1, 2, 1, 2, 1, 4, 2, 1, 2, 1, 2, 1, 2},
        {1, 2, 1, 1, 2, 2, 1, 2, 2, 1, 2, 2, 0},
        {1, 1, 2, 1, 1, 2, 1, 2, 2, 1, 2, 2, 0},
        {2, 1, 1, 4, 1, 1, 2, 1, 2, 1, 2, 2, 2},
        {1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 0},
        {2, 1, 2, 1, 2, 1, 1, 2, 3, 2, 1, 2, 2},
        {1, 2, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 0},
        {1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 0},
        {2, 1, 2, 1, 2, 2, 3, 2, 1, 2, 1, 2, 1},

        /*1961*/   {2, 1, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 0},
        {1, 2, 1, 1, 2, 1, 2, 2, 1, 2, 2, 1, 0},
        {2, 1, 2, 1, 3, 2, 1, 2, 1, 2, 2, 2, 1},
        {2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 0},
        {1, 2, 1, 2, 1, 1, 2, 1, 1, 2, 2, 2, 0},
        {1, 2, 2, 3, 2, 1, 1, 2, 1, 1, 2, 2, 1},
        {2, 2, 1, 2, 2, 1, 1, 2, 1, 2, 1, 2, 0},
        {1, 2, 2, 1, 2, 1, 2, 3, 2, 1, 2, 1, 2},
        {1, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 1, 0},
        {2, 1, 1, 2, 2, 1, 2, 1, 2, 2, 1, 2, 0},

        /*1971*/   {1, 2, 1, 1, 2, 3, 2, 1, 2, 2, 2, 1, 2},
        {1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 1, 0},
        {2, 1, 2, 1, 1, 2, 1, 1, 2, 2, 2, 1, 0},
        {2, 2, 1, 2, 3, 1, 2, 1, 1, 2, 2, 1, 2},
        {2, 2, 1, 2, 1, 1, 2, 1, 1, 2, 1, 2, 0},
        {2, 2, 1, 2, 1, 2, 1, 2, 3, 2, 1, 1, 2},
        {2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 1, 0},
        {2, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 1, 0},
        {2, 1, 1, 2, 1, 2, 4, 1, 2, 2, 1, 2, 1},
        {2, 1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 0},

        /*1981*/   {1, 2, 1, 1, 2, 1, 1, 2, 2, 1, 2, 2, 0},
        {2, 1, 2, 1, 3, 2, 1, 1, 2, 2, 1, 2, 2},
        {2, 1, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 0},
        {2, 1, 2, 2, 1, 1, 2, 1, 1, 2, 3, 2, 2},
        {1, 2, 2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 0},
        {1, 2, 2, 1, 2, 2, 1, 2, 1, 2, 1, 1, 0},
        {2, 1, 2, 2, 1, 2, 3, 2, 2, 1, 2, 1, 2},
        {1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1, 0},
        {2, 1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 0},
        {1, 2, 1, 1, 2, 3, 1, 2, 2, 1, 2, 2, 2},

        /*1991*/   {1, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 2, 0},
        {1, 2, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 0},
        {1, 2, 2, 3, 2, 1, 2, 1, 1, 2, 1, 2, 1},
        {2, 2, 2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 0},
        {1, 2, 2, 1, 2, 2, 1, 2, 3, 2, 1, 1, 2},
        {1, 2, 1, 2, 2, 1, 2, 1, 2, 2, 1, 2, 0},
        {1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1, 0},
        {2, 1, 1, 2, 1, 3, 2, 2, 1, 2, 2, 2, 1},
        {2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 2, 1, 0},
        {2, 2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 1, 0},

        /*2001*/   {2, 2, 2, 1, 3, 2, 1, 1, 2, 1, 2, 1, 2},
        {2, 2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 0},
        {2, 2, 1, 2, 2, 1, 2, 1, 1, 2, 1, 2, 0},
        /*2004*/   {1, 2, 3, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2},
        /*2005*/   {1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1, 1, 0},
        /*2006*/   {2, 1, 2, 1, 2, 1, 2, 3, 2, 2, 1, 2, 2},
        {1, 1, 2, 1, 1, 2, 1, 2, 2, 2, 1, 2, 0},
        {2, 1, 1, 2, 1, 1, 2, 1, 2, 2, 1, 2, 0},
        /*2009*/   {2, 2, 1, 1, 2, 3, 1, 2, 1, 2, 1, 2, 2},
        {2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 0},

        /*2011*/   {2, 1, 2, 2, 1, 2, 1, 1, 2, 1, 2, 1, 0},
        {2, 1, 2, 4, 2, 1, 2, 1, 1, 2, 1, 2, 1},
        {2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2, 0},
        /*2014*/	 {1, 2, 1, 2, 1, 2, 1, 2, 2, 3, 2, 1, 2},
        {1, 2, 1, 1, 2, 1, 2, 2, 2, 1, 2, 1, 0},
        {2, 1, 2, 1, 1, 2, 1, 2, 2, 1, 2, 2, 0},
        /*2017*/   {1, 2, 1, 2, 1, 3, 2, 1, 2, 1, 2, 2, 2},
        {1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 0},
        {2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 0},
        {2, 1, 2, 2, 3, 2, 1, 1, 2, 1, 2, 1, 2},

        /*2021*/   {1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 0},
        {2, 1, 2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 0},
        {1, 2, 3, 2, 1, 2, 1, 2, 2, 1, 2, 1, 2},
        {1, 2, 1, 1, 2, 1, 2, 2, 1, 2, 2, 1, 0},
        {2, 1, 2, 1, 1, 2, 3, 2, 1, 2, 2, 2, 1},
        {2, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 0},
        {1, 2, 1, 2, 1, 1, 2, 1, 1, 2, 2, 2, 0},
        {1, 2, 2, 1, 2, 3, 1, 2, 1, 1, 2, 2, 1},
        {2, 2, 1, 2, 2, 1, 1, 2, 1, 1, 2, 2, 0},
        {1, 2, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 0},

        /*2031*/   {2, 1, 2, 3, 2, 1, 2, 2, 1, 2, 1, 2, 1},
        {2, 1, 1, 2, 1, 2, 2, 1, 2, 2, 1, 2, 0},
        {1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 3, 2},
        {1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 2, 1, 0},
        {2, 1, 2, 1, 1, 2, 1, 1, 2, 2, 1, 2, 0},
        {2, 2, 1, 2, 1, 1, 4, 1, 1, 2, 2, 1, 2},
        {2, 2, 1, 2, 1, 1, 2, 1, 1, 2, 1, 2, 0},
        {2, 2, 1, 2, 1, 2, 1, 2, 1, 1, 2, 1, 0},
        {2, 2, 1, 2, 2, 3, 2, 1, 2, 1, 2, 1, 1},
        {2, 1, 2, 2, 1, 2, 2, 1, 2, 1, 2, 1, 0},

        /*2041*/   {2, 1, 1, 2, 1, 2, 2, 1, 2, 2, 1, 2, 0},
        {1, 2, 3, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2},
        {1, 2, 1, 1, 2, 1, 1, 2, 2, 1, 2, 2, 0}
    };

    private static final int		s_arrnDT[] = {
        384, 355, 354, 384, 354, 354, 384, 354, 355, 384,  // 1881 ~
        355, 384, 354, 354, 383, 355, 354, 384, 355, 384,  // 1891 ~
        354, 355, 383, 354, 355, 384, 354, 355, 384, 354,  // 1901 ~
        384, 354, 354, 384, 355, 354, 384, 355, 384, 354,  // 1911 ~
        354, 384, 354, 354, 385, 354, 355, 384, 354, 383,  // 1921 ~
        354, 355, 384, 355, 354, 384, 354, 384, 354, 354,
        384, 355, 355, 384, 354, 354, 384, 354, 384, 354,
        355, 384, 355, 354, 384, 354, 384, 354, 354, 384,
        355, 354, 384, 355, 354, 383, 355, 384, 354, 355,	// 1961 ~
        384, 354, 354, 384, 354, 384, 354, 355, 384, 355,
        354, 384, 354, 384, 354, 354, 385, 354, 355, 384,
        354, 354, 383, 355, 384, 355, 354, 384, 354, 354,
        384, 354, 355, 384, 354, 385, 354, 354, 384, 354,  // 2001 ~
        354, 384, 355, 384, 354, 355, 384, 354, 354, 384,  // 2011 ~
        354, 355, 384, 354, 384, 355, 354, 383, 355, 354,  // 2021 ~
        384, 355, 384, 354, 354, 384, 354, 354, 384, 355,  // 2031 ~
        355, 384, 354                                      // 2041 ~
    };

    //------------------------------------------------------------------------
    // Member Functions
    static long	MAKEDATE(long bLunar,long bLeapMonth,long Year,long Month, long Day) {
        return (((bLunar)<<31)|((bLeapMonth)<<30)|((Year)<<16)|((Month)<<8)|(Day));
    }
    static long	GETDAY(long Date) {
        return ((Date)&0xFF);
    }
    static long	GETMONTH(long Date) {
        return (((Date)&0xFF00)>>8);
    }
    static long	GETYEAR(long Date) {
        return (((Date)&0xFFF0000)>>16);
    }

    static long	ISLUNAR(long Date) {
        return (int)(((Date)&0x80000000)>>31);
    }
    static boolean	ISLEAPMONTH(long Date) {
        return (((Date)&0x40000000)>>30) != 0 ;
    }
    static long	ISLEAPYEAR(long Year) {
        return (int)((((Year) % 400 != 0) ? ( ((Year) % 100 != 0) ? (((Year) & 0x3) != 0 ? 0 : 1) : 0 ) : 1));
    }

    //-------------------------------------------------------------------------------------------------
    // 전체 일수를 구함
    //-------------------------------------------------------------------------------------------------
    static int GetFullDay(int nYear) {
        int nFullDay = 0;

        if ( AppConfig.DEBUG ) {
            if (nYear <= 0)
                return -1;
        }
        int i = 1;

        if (nYear >= 1980) {
            i += 1980;
            nFullDay = 723180;
        }

        for (;i<=nYear;i++)
            nFullDay += GetFullYearDay(i);

        return nFullDay;
    }

    //-------------------------------------------------------------------------------------------------
    // 전체 일수를 구함
    //-------------------------------------------------------------------------------------------------
    static int GetFullDay(int nYear, int nMonth) {
        int nFullDay = 0;

        if ( AppConfig.DEBUG ) {
            if (nYear <= 0)
                return -1;
            if (nMonth<=0 || nMonth>12)
                return -1;
        }

        nFullDay = GetFullDay(nYear-1);

        for (int i=1;i<=nMonth;i++) {
            nFullDay += GetFullMonthDay(nYear,i);
        }

        return nFullDay;
    }

    //-------------------------------------------------------------------------------------------------
    // 전체 일수를 구함
    //-------------------------------------------------------------------------------------------------
    static int GetFullDay(int nYear, int nMonth, int nDay) {
        int nFullDay = 0;
        if ( AppConfig.DEBUG ) {
            if (nYear <= 0)
                return -1;

            if (nMonth<=0 || nMonth>12)
                return -1;

            if (GetFullDay(nYear,nMonth)<nDay)
                return -1;
        }

        if (nMonth!=1)
            nFullDay = GetFullDay(nYear,nMonth-1);
        else
            nFullDay = GetFullDay(nYear-1);

        nFullDay = nFullDay+nDay;
        return nFullDay;
    }

    //-------------------------------------------------------------------------------------------------
    // 특정 년도의 전체 일수를 구함
    //-------------------------------------------------------------------------------------------------
    static int GetFullYearDay(int nYear) {
        if ( AppConfig.DEBUG ) {
            if (nYear <= 0)
                return -1;
        }

        if (nYear%400 == 0)
            return 366;
        else if (nYear%100 == 0)
            return 365;
        else if (nYear%4 == 0)
            return 366;
        else
            return 365;
    }

    //-------------------------------------------------------------------------------------------------
    // 특정 년도 월의 전체 일수를 구함
    //-------------------------------------------------------------------------------------------------
    public static int GetFullMonthDay(int nYear, int nMonth) {
        if ( AppConfig.DEBUG ) {
            if (nYear <= 0)
                return -1;

            if (nMonth<=0 || nMonth>12)
                return -1;
        }

        switch (nMonth) {
        case 1:
        case 3:
        case 4:
        case 5:
        case 6:
        case 7:
        case 8:
        case 9:
        case 10:
        case 11:
        case 12:
            return s_arrnMonthDay[nMonth];
        case 2: {
            if (nYear%400 == 0)
                return 29;
            else if (nYear%100 == 0)
                return 28;
            else if (nYear%4 == 0)
                return 29;
            else
                return 28;
        }
        }
        return -1;
    }

    //-------------------------------------------------------------------------------------------------
    // 몇번째 주, 무슨요일인지를 통해 몇일인지를 알아냄.
    //-------------------------------------------------------------------------------------------------
    public static int GetDay(int nYear, int nMonth, int nDayOfWeek, int nWeekNum) {
        int nWeek = 0;
        for (int i=1;i<=GetFullMonthDay(nYear,nMonth);i++) {
            int nCurDayOfWeek = GetDayOfWeek(nYear,nMonth,i);
            if (nCurDayOfWeek == nDayOfWeek && nWeek == nWeekNum)
                return i;
            if (nCurDayOfWeek == E_SATURDAY)
                nWeek++;
        }
        return -1;
    }

    //-------------------------------------------------------------------------------------------------
    //
    //-------------------------------------------------------------------------------------------------
    public static int GetWeek(int nYear, int nMonth, int nDay) {
        int nNumWeek = 0;
        for (int i=1;i<=nDay;i++) {
            int nDayOfWeek = GetDayOfWeek(nYear,nMonth,i);
            if (nDayOfWeek==0 && i!=1)
                nNumWeek++;
        }
        return nNumWeek;
    }

    //-------------------------------------------------------------------------------------------------
    // 요일을 리턴
    //-------------------------------------------------------------------------------------------------
    public static int GetDayOfWeek(int nYear, int nMonth, int nDay) {
        if ( AppConfig.DEBUG ) {
            if (nYear<=0)
                return -1;

            if (nMonth<=0 || nMonth>12)
                return -1;

            if (GetFullDay(nYear,nMonth)<nDay)
                return -1;
        }
        int nFullDay = GetFullDay(nYear,nMonth,nDay);
        return nFullDay % 7;
    }

    //-------------------------------------------------------------------------------------------------
    // 두 날짜의 기간을 구하는 함수
    //-------------------------------------------------------------------------------------------------
    static int GetDurationBetween(int nYear1,int nMonth1,int nDay1,int nYear2, int nMonth2, int nDay2) {
        if ( AppConfig.DEBUG ) {
            if (nYear1<=0)
                return -1;

            if (nMonth1<=0 || nMonth1>12)
                return -1;

            if (GetFullDay(nYear1,nMonth1)<nDay1)
                return -1;

            if (nYear2<=0)
                return -1;

            if (nMonth2<=0 || nMonth2>12)
                return -1;

            if (GetFullDay(nYear2,nMonth2)<nDay2)
                return -1;
        }
        return GetFullDay(nYear2,nMonth2,nDay2) - GetFullDay(nYear1,nMonth1,nDay1);
    }

    //-------------------------------------------------------------------------------------------------
    // 양력을 음력으로 변환
    //-------------------------------------------------------------------------------------------------
    static long ConvertSol2Lun(long SolDate) {
        long	sYear	= GETYEAR(SolDate);
        long	sMonth	= GETMONTH(SolDate);
        long	sDay	= GETDAY(SolDate);
        long	lYear, lMonth, lDay, IsYun;
        byte	m0, m1, m2, i, j, jcount;
        long		td, td0, td1, td2, k11;

        if (sYear<1900 || sYear>2041)
            return -1;
        if (sYear==2041 && sMonth>1)
            return -1;

        td1		= 686686;

        // ## 1. 1. 1. - syear. smonth. sday. ##
        k11		= sYear - 1;
        td2		= k11*365 + k11/4 - k11/100 + k11/400;			//총 년수를 일수로 변환

        if ((sYear%400 == 0) || (sYear%100 != 0) && (sYear%4 == 0))
            s_arrnMonthDay[2] = 29;
        else
            s_arrnMonthDay[2] = 28;

        for (i=1 ; i<sMonth ; i++)
            td2	= td2 + s_arrnMonthDay[i];

        td2		= td2 + sDay;

        // ## 1881. 1. 30. - sYear. sMonth. sDay. ##
        td		= td2 - td1 + 1;

        // ## Lunar Year Caculation ##
        td0		= s_arrnDT[0];
        for (i=0 ; i<163 ; i++) {
            if (td <= td0)
                break;
            td0	= td0 + s_arrnDT[i+1];
        }
        lYear = i + 1881;				// Calculated Lunar Year

        // ## Lunar Month Calculation ##
        td0		= td0 - s_arrnDT[i];
        td		= td - td0;
        if (s_arrbtKK[i][12] != 0)
            jcount = 13;
        else
            jcount = 12;

        m2		= 0;
        for (j=0 ; j<jcount ; j++) {
            if (s_arrbtKK[i][j] <=2)
                m2++;
            if (s_arrbtKK[i][j] <=2)
                m1 = (byte)((s_arrbtKK[(int)i][(int)j]) + (byte)28);
            else
                m1 = (byte)((s_arrbtKK[(int)i][(int)j]) + (byte)26);

            if (td <= m1)
                break;
            td = td - m1;
        }
        m0		= j;
        lMonth = m2;					// Calculated Lunar Month
        lDay	= (byte)td;				// Calculated Lunar Day

        if (((int)s_arrbtKK[(int)(lYear-1881)][(int)12] != 0) && ((int)s_arrbtKK[(int)(lYear-1881)][(int)m0] > 2))
            IsYun = 1;
        else
            IsYun = 0;

        return MAKEDATE(1, IsYun, lYear, lMonth, lDay);
    }

    //-------------------------------------------------------------------------------------------------
    // 음력을 양력으로 변환
    //-------------------------------------------------------------------------------------------------
    static long ConvertLun2Sol(long LunDate) {
        long		lYear	= GETYEAR(LunDate);
        long		lMonth	= GETMONTH(LunDate);
        long		lDay	= GETDAY(LunDate);
        boolean		IsYun	= ISLEAPMONTH(LunDate);
        long		sYear, sMonth, sDay;
        long		checkDate, checkMonth, checkDay;
        long		m1=0, m2, n2;
        long		i, j;
        long		td;
        boolean 	leap;

        j		= CLNDLIB_NOTINVALID;

        if (lYear<1900 || lYear>2040)
            return -1;

        if (lMonth == 0 || lMonth > 12)
            return -1;

        if (lDay == 0 || lDay > 31)
            return -1;

        if ((LunDate & 0x80000000) == 0)		//	입력값이 양력이면 들어온값 바로 리턴
            return LunDate;

        //2002.7.17 윤달check
        for (i=1 ; i<=12 ; i++) {
            if (s_arrbtKK[(int)(lYear-1881)][(int)(i-1)] > 2)
                j = i;
        }

        if ((lDay > s_arrbtKK[(int)(lYear-1881)][(int)j]+28) && (j != CLNDLIB_NOTINVALID))
            return -1;

        td = 0;

        if (lYear != 1881) {
            m1 = lYear - 1882;
            for (i=0 ; i<=m1 ; i++) {
                for (j=0 ; j<13 ; j++) {
                    td = td + s_arrbtKK[(int)i][(int)j];
                }
                if (s_arrbtKK[(int)i][12] == 0)
                    td = td + 336;
                else
                    td = td + 362;
            }
        }

        m1++;
        n2 = lMonth - 1;
        m2 = 0;

        do {
            if (s_arrbtKK[(int)m1][(int)m2] > 2) {
                td = td + 26 + s_arrbtKK[(int)m1][(int)m2];
                n2++;
            } else if (m2 == n2)
                break;
            else
                td = td + 28 + s_arrbtKK[(int)m1][(int)m2];
            m2++;
        } while (true);

        if (IsYun == true)
            td = td + 28 + s_arrbtKK[(int)m1][(int)m2];

        td = td + lDay + 29;
        m1 = 1880;

        do {
            m1++;
            leap = ((m1%400 == 0) || (m1%100 != 0) && (m1%4 == 0));
            if (leap)
                m2 = 366;
            else
                m2 = 365;
            if (td < m2)
                break;
            td = td - m2;
        } while (true);

        sYear = m1;
        s_arrnMonthDay[2] = (int)m2 - 337;
        m1 = 0;

        do {
            m1++;
            if (td <= s_arrnMonthDay[(int)m1])
                break;
            td = td - s_arrnMonthDay[(int)m1];
        } while (true);

        sMonth = (byte)m1;
        sDay	= td;

        checkDate	= ConvertSol2Lun(MAKEDATE(0, 0, sYear, sMonth, sDay));
        checkMonth	= GETMONTH(checkDate);
        checkDay	= GETDAY(checkDate);
        if ((checkMonth != lMonth) || (checkDay != lDay))
            return -1;
        return MAKEDATE(0, 0, sYear, sMonth, sDay);
    }
}